templates/playwright/test-data/soap/Calculator.ts.ejs

export const calculatorSoapData = {
  add: {
    url: process.env.CALC_SOAP_WSDL_URL!,
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'http://tempuri.org/Add',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>2</intA>
      <intB>3</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
`.trimStart(), // 🔑 critical,
    responsePath: 'Envelope.Body.AddResponse.AddResult',
  },
  subtract: {
    url: process.env.CALC_SOAP_WSDL_URL!,
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'http://tempuri.org/Subtract',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Subtract xmlns="http://tempuri.org/">
      <intA>10</intA>
      <intB>4</intB>
    </Subtract>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.SubtractResponse.SubtractResult',
  },
  multiply: {
    url: process.env.CALC_SOAP_WSDL_URL!,
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'http://tempuri.org/Multiply',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Multiply xmlns="http://tempuri.org/">
      <intA>6</intA>
      <intB>7</intB>
    </Multiply>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.MultiplyResponse.MultiplyResult',
  },
  divide: {
    url: process.env.CALC_SOAP_WSDL_URL!,
    headers: {
      'Content-Type': 'text/xml; charset=utf-8',
    },
    soapAction: 'http://tempuri.org/Divide',
    body: `
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Divide xmlns="http://tempuri.org/">
      <intA>10</intA>
      <intB>2</intB>
    </Divide>
  </soap:Body>
</soap:Envelope>
`.trimStart(),
    responsePath: 'Envelope.Body.DivideResponse.DivideResult',
  },
};
